// ============================== ОБЯЗАТЕЛЬНЫЕ НАСТРОЙКИ ==============================================================================================

#define USE_WEMOS 1  // Использование Wemos mini

// Лента
#define NUM_LEDS 226  // Количество светодиодов
#define CURRENT_LIMIT 0

// Управление
#define IR_REMOTE 0  // ИК управление. 1 - включено, 0 - отключено

#define NET_REMOTE 1    // Управление через сервер. 1 - включено, 0 - отключено
#define NET_DELAY 3000  // Задержка между запросами на сервер

// Автонастройка нижнего порога шумов
#define AUTO_LOW_PASS 1

#if (USE_WEMOS && NET_REMOTE)
const char* ssid = "Davidoff";
const char* password = "Nata1426_Nata";
String server = "https://smartled.onrender.com/getData";
#endif
// =====================================================================================================================================================


// ============================== ВТОРИЧНЫЕ НАСТРОЙКИ ==================================================================================================

#define REMOTE_STEP 16

// Нижний порог шумов
uint16_t LOW_PASS = 70;      // Нижний порог шумов режим VU, ручная настройка
byte SPEKTR_LOW_PASS = 50;   // Нижний порог шумов режим спектра, ручная настройка
#define LOW_PASS_ADD 13      // "Добавочная" величина к нижнему порогу, для надёжности (режим VU)
#define LOW_PASS_FREQ_ADD 3  // "Добавочная" величина к нижнему порогу, для надёжности (режим частот)

// =====================================================================================================================================================


// ============================== Пины =================================================================================================================

#if !USE_WEMOS
#define LED_PIN 12  // Пин DI светодиодной ленты
#define BTN_PIN 3   // Пин кнопки для управления
#define IR_PIN 2    // Пин ИК приёмника
#else
#define LED_PIN 2  // Пин DI светодиодной ленты
#endif

#if USE_WEMOS
#define SOUND_MIC A0  // Пин микрофона на wemos mini
#else
#define SOUND_MIC A2       // Пин микрофона
#define SOUND_MIC_FREQ A3  // Пин микрофона для режима с частотами (через кондер)
#endif

// =====================================================================================================================================================


// ==================================Кнопки Пульта======================================================================================================

#if (IR_REMOTE)
#define BUTT_UP 0xA087E061
#define BUTT_DOWN 0xF4CC3E61
#define BUTT_LEFT 0xD97A3061
#define BUTT_RIGHT 0x6D266E61
#define BUTT_OK 0xD6656B61
#define BUTT_1 0x9251CA61
#define BUTT_2 0x8F3D0561
#define BUTT_3 0x25FE0861
#define BUTT_4 0xC82F5561
#define BUTT_5 0xC51A9061
#define BUTT_6 0x5BDB9361
#define BUTT_7 0xE6962861
#define BUTT_8 0xE3816361
#define BUTT_9 0x7A426661
#define BUTT_0 0x195EEE61
#define BUTT_STAR 0x1C73B361  // *
#define BUTT_HASH 0xB01FF161  // #
#endif

// =====================================================================================================================================================


// ============================== ДЛЯ РАЗРАБОТЧИКОВ ====================================================================================================

// ---------------- Библиотеки --------------------------------------------------------------------------

#include <FastLED.h>
CRGB leds[NUM_LEDS];

#define FHT_N 64
#define LOG_OUT 1
#include <FHT.h>

#if IR_REMOTE
#include <IRLremote.h>
CHashIR IRLremote;
volatile uint32_t IRdata;  // Переменная для ИК команд
#endif

#if (USE_WEMOS && NET_REMOTE)
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266HTTPClient.h>
#include <ArduinoJson.h>
StaticJsonDocument<128> jsonDoc; // Создаем объект JSON-документа
#endif
// ---------------- Объявление переменных ---------------------------------------------------------------
LEDControlData led_control_data;

// Цвета для HSV
#define HUE_ORANGE 32
#define HUE_BLUE 160

#define MAIN_LOOP 5

unsigned int milli;
unsigned int timer_arr_int[3];

#define WHITE_TEMP settings[0]
#define LIGHT_COLOR settings[0]
#define EFFECT_DELAY settings[0]

#define LIGHT_SAT settings[1]
// =====================================================================================================================================================


// =====================================================================================================================================================

// === Объявление всех использующихся функций для более быстрой и беспроблемной компиляции (на конечный размер скетча никак не влияет)==================

// --- Utility Functions --------------------------------------------------------------------------------------------------------------
void setupLED();
int smartIncr(int value, int incr_step, int mininmum, int maximum);
float smartIncrFloat(float value, float incr_step, float mininmum, float maximum);

// --- Animation ---------------------------------------------------------------------------------------------------------------------                                                      // Переключить Микрофон/Линейный
void animation();

// --- Audio -----------------------------------------------------------------------------------------------------------------------                                                      // Переключить Микрофон/Линейный
void analyzeAudio();
void autoLowPass();

// --- Remote -----------------------------------------------------------------------------------------------------------------------                                                      // Переключить Микрофон/Линейный
void remoteTick();
void RemoteFunc(uint32_t IRdata);

// --- Effects -----------------------------------------------------------------------------------------------------------------------                                                      // Переключить Микрофон/Линейный
void one_color_all(byte hue = 0, byte sat = 0, byte val = 0);

// --- Network -----------------------------------------------------------------------------------------------------------------------
void networkTick();
void connectWifi();

// =====================================================================================================================================================